Autodesk.Navisworks.Api.ProgressErrorReportingEventArgs
Event arguments used for the Application::ProgressErrorReporting event

Autodesk.Navisworks.Api.ProgressErrorReportingEventArgs.Canceled
Sets a value indicating whether the operation should be canceled.

Autodesk.Navisworks.Api.ProgressErrorReportingEventArgs.ErrorCode
Gets the error code that describes the current Error.

Autodesk.Navisworks.Api.ProgressErrorReportingEventArgs.IsFileError
Gets whether the Error being reported was related to a file operation.

Autodesk.Navisworks.Api.ProgressErrorReportingEventArgs.Message
Gets a message that describes the current error.

Autodesk.Navisworks.Api.ProgressErrorReportingEventArgs.Progress
Gets a reference to the Progress class instance relating to this Event.